#for循环
    #for...in...(依次把list或tuple中的每个元素迭代出来)
    #for x in...(就是把每个元素代入变量x，然后执行缩进块的语句)
number = ['1','2','3']
for a in number:
    print(a)

#list(range(101))(输出为[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100])
sum=0
for b in range(101):
    sum=sum+b
print(sum)


#while循环
    #只要条件满足，就不断循环，条件不满足时退出循环。

sum=0
n=99
while n>0:
    sum=sum+n
    n=n-2
print(sum)


